       01 PAYROLL-RECORD.
           05 PR-EMPLOYEE-ID                PIC X(10).
           05 PR-EMPLOYEE-NAME              PIC X(30).
           05 PR-EMPLOYEE-DEPARTMENT        PIC X(20).
           05 PR-PAYROLL-AMOUNT             PIC 9(5)V99.
